NextFOAM-2409/tutorials/multiphase/interPhaseChangeDyMFoam/propeller/system/surfaceFeatureExtractDictDefaults
// How to obtain raw features (extractFromFile || extractFromSurface)
extractionMethod    extractFromSurface;

// includedAngle:
// Mark edges whose adjacent surface normals are at an angle less
// than includedAngle as features
// - 0  : selects no edges
// - 180: selects all edges
includedAngle       150;

trimFeatures
{
    // Remove features with fewer than the specified number of edges
    minElem         10;
}
